'''
不同的幂
考虑所有满足2≤a≤5和2≤b≤5的整数组合所生成的幂a^b：
2^2=4, 2^3=8, 2^4=16, 2^5=32
3^2=9, 3^3=27, 3^4=81, 3^5=243
4^2=16, 4^3=64, 4^4=256, 4^5=1024
5^2=25, 5^3=125, 5^4=625, 5^5=3125
如果把这些幂从小到大排列并去重，我们得到以下由15个不同的项组成的序列：
4,8,9,16,25,27,32,64,81,125,243,256,625,1024,3125
考虑所有满足2≤a≤100和2≤b≤100的整数组合所生成的幂a^b，将它们排列并去重所得到
的序列有多少个不同的项？
'''

# 循环的时候对列表做一个检查即可

powersList = []

for a in range(2,101):
    for b in range(2, 101):
        power = a ** b
        if not power in powersList:
            powersList.append(power)

print(len(powersList))
